thethiny/MK12TTH/source/src/mk12hook.cpp
#include "mk12hook.h"
#include "GamePatchManager.h"


HookMetadata::ActiveMods			HookMetadata::ActiveModsMap;
HookMetadata::CheatsStruct			HookMetadata::sCheatsStruct;
HookMetadata::LibMapsStruct			HookMetadata::sLFS;
HookMetadata::UserKeysStruct		HookMetadata::sUserKeys;
HookMetadata::GameReadyState		HookMetadata::sGameState;
HookMetadata::SwapTable				HookMetadata::FSwapTable;
// Thread safety note: FSwapTable is only written at startup (AnnouncerSwap/StringSwaps) and read-only after.
// FloydCluesInfo and UserProfileInfo are written by NRS-to-UE proxies which are single-threaded within NRS's caller.
// If additional hooks are added that write to these from different call sites, add synchronization.
HookMetadata::FloydCluesInfo		HookMetadata::CurrentFloydInfo;
HookMetadata::ProfileInfo			HookMetadata::UserProfileInfo;



namespace MK12Hook::Proxies {

	void ReadFNameToWStrId(MK12::FName& Name, char* dest)
	{
		printf("Proxy FNameToWStrId::Captured::");
		MK12::FNameFunc::Print(Name);

		MK12::FName *current_fname = ReadFNameToWStr(Name, dest);

		RegisterHacks::MoveToRBX(MK12::FNameFunc::GetSize(*current_fname));
	}
	void ReadFNameToWStrNoId(MK12::FName& Name, char* dest)
	{
		printf("Proxy FNameToWStrNoId::Captured::");
		MK12::FNameFunc::Print(Name);

		MK12::FName *current_fname = ReadFNameToWStr(Name, dest);

		RegisterHacks::MoveToRBX((uint64_t)&current_fname->NameSize);
	}

	void ReadFNameToWStrCommon(MK12::FName& Name, char* dest)
	{
		printf("Proxy FNameToWStrCommon::Captured::");
		MK12::FNameFunc::Print(Name);

		MK12::FName* current_fname = ReadFNameToWStr(Name, dest);

		RegisterHacks::MoveToRBX((uint64_t)&current_fname->NameSize); // Needs testing
	}

	MK12::FName* ReadFNameToWStr(MK12::FName &Name, char* dest)
	{
		const char* name = MK12::FNameFunc::ToStr(Name);
		if (containsCaseInsensitive(name, "skin007_pal004"))
		{
			printf("DEBUGME");
		}
		MK12::FName* swap = HookMetadata::FSwapTable.get(name);
		if (swap == nullptr)
		{
			MK12::FNameToWStr(Name, dest);
			return &Name;
		}
		
		printf("Swap To::");
		MK12::FNameFunc::Print(*swap);
		MK12::FNameToWStr(*swap, dest);
		
		return swap;
	}

	wchar_t** OverrideGameEndpoint(MK12::JSONEndpointValue obj, wchar_t** EndpointAddress)
	{
		CPPython::string ServerUrl = SettingsMgr->szServerUrl;

		if (HookMetadata::ActiveModsMap["bGameEndpointSwap"] && !ServerUrl.empty())
		{
			ServerUrl = ServerUrl.strip("/");

#pragma warning(push)
#pragma warning(disable: 4267)
			int StringLength = (ServerUrl.size() + 1) * 2;
			std::wstring wServerUrl = std::wstring(ServerUrl.begin(), ServerUrl.end());

			wprintf(L"Replacing endpoint \"%s\" with \"%s\"!\n", obj.ValuePointer, wServerUrl.c_str());

			static wchar_t* cachedServerUrl = nullptr;
			static int cachedServerLen = 0;
			if (!cachedServerUrl)
			{
				cachedServerUrl = new wchar_t[StringLength];
				memcpy(cachedServerUrl, wServerUrl.c_str(), StringLength);
				cachedServerLen = ServerUrl.size() + 1;
			}

#pragma warning(pop)
			obj.ValuePointer = cachedServerUrl;
			obj.ValueLength = cachedServerLen; // Characters count in str and not wstr
			obj.ValueLength8BAligned = (obj.ValueLength + 7) & (~7);

			MK12::GetEndpointKeyValue(obj, EndpointAddress);
			return &obj.ValuePointer;
		}

		return MK12::GetEndpointKeyValue(obj, EndpointAddress);

	}

	MK12::TArray<uint32_t>* GenerateFloydCluesFromHashProxy(MK12::TArray<uint32_t>* ArrayLocation, uint64_t ShuffleSeed, uint64_t unk, uint64_t unk2)
	{ // Use hash to create 10 challenges

		printf("Floyd Shuffle Seed: %llX\n", (uint64_t)ShuffleSeed);
		MK12::TArray<uint32_t>* ReturnedArrayLocation = MK12::GenerateFloydCluesFromHash(ArrayLocation, ShuffleSeed, unk, unk2); // 8 bytes location and 4 bytes count

		if (ReturnedArrayLocation && ReturnedArrayLocation->Data) {

			// Store the data
			uint32_t newUserProfileHash = (uint32_t)(ShuffleSeed >> 32);
			uint32_t newFloydEncounters = (uint32_t)(ShuffleSeed & 0xFFFFFFFF);

			if (newFloydEncounters > HookMetadata::CurrentFloydInfo.FloydEncounters)
			{
				HookMetadata::CurrentFloydInfo.Clues.clear();

				for (uint8_t i = 0; i < ReturnedArrayLocation->ElementsCount; i++)
				{
					HookMetadata::CurrentFloydInfo.Clues.push_back((uint8_t)ReturnedArrayLocation->Data[i] + 1);
				}

				HookMetadata::CurrentFloydInfo.UserProfileHash = newUserProfileHash;
				HookMetadata::CurrentFloydInfo.FloydEncounters = newFloydEncounters;
			}

			printf("Floyd Challenges: ");
			for (int32_t i = 0; i < ReturnedArrayLocation->ElementsCount; ++i) {
				printf("%i ", (uint32_t)ReturnedArrayLocation->Data[i]+1);
			}
			printf("\n");
		}
		else {
			printfError("Couldn't Read Floyd Challenges!\n");
		}

		return ReturnedArrayLocation;
	}

	uint32_t CustomCityHashProxy(wchar_t** StringToHash)
	{ // Hash the floyd string
		if (StringToHash && *StringToHash) {
			printf("StringToHash: %ls\n", *StringToHash); // %ls for wchar_t*

			CPPython::string str(*StringToHash);
			std::vector<CPPython::string> parts = str.split("/");

			if (!parts.empty() && !HookMetadata::UserProfileInfo.OfflineProfileId)
			{
				std::vector<CPPython::string> pipeParts = parts[0].split("|");

				if (pipeParts.size() >= 2)
				{
					delete[] HookMetadata::UserProfileInfo.OfflineProfileId;

					size_t len = pipeParts[1].size() + 1;
					HookMetadata::UserProfileInfo.OfflineProfileId = new wchar_t[len];
					mbstowcs(HookMetadata::UserProfileInfo.OfflineProfileId, pipeParts[1].c_str(), len);

					if (SettingsMgr->iLogLevel)
						printf("OfflineProfileId extracted: %ls\n", HookMetadata::UserProfileInfo.OfflineProfileId);
				}
				else
				{
					if (SettingsMgr->iLogLevel)
						printf("OfflineProfileId not found. Single User Profile only.\n");
				}
			}
			if (parts.size() == 2 && !HookMetadata::UserProfileInfo.HydraId)
			{
				delete[] HookMetadata::UserProfileInfo.HydraId;

				size_t len = parts[1].size() + 1;
				HookMetadata::UserProfileInfo.HydraId = new wchar_t[len];
				mbstowcs(HookMetadata::UserProfileInfo.HydraId, parts[1].c_str(), len);
				if (SettingsMgr->iLogLevel)
					printf("HydraId extracted: %ls\n", HookMetadata::UserProfileInfo.HydraId);
			}
			else if (parts.size() >= 3 && !HookMetadata::UserProfileInfo.WBId)
			{
				delete[] HookMetadata::UserProfileInfo.HydraId;
				delete[] HookMetadata::UserProfileInfo.WBId;

