thethiny/MK12TTH/source/src/mk12hook.cpp
				size_t len1 = parts[1].size() + 1;
				size_t len2 = parts[2].size() + 1;

				HookMetadata::UserProfileInfo.HydraId = new wchar_t[len1];
				HookMetadata::UserProfileInfo.WBId = new wchar_t[len2];

				mbstowcs(HookMetadata::UserProfileInfo.HydraId, parts[1].c_str(), len1);
				mbstowcs(HookMetadata::UserProfileInfo.WBId, parts[2].c_str(), len2);

				if (SettingsMgr->iLogLevel)
				{
					printf("HydraId extracted: %ls\n", HookMetadata::UserProfileInfo.HydraId);
					printf("WBId extracted: %ls\n", HookMetadata::UserProfileInfo.WBId);
				}

			}
			else {
				if (SettingsMgr->iLogLevel)
					printf("Offline Mode Floyd String Hash Detected!");
			}
		}
		else
		{
			printfError("StringToHash Is Empty!\n");
		}
		
		uint32_t HashResult = MK12::CustomCityHash(StringToHash);
		printf("HashResult: %X\n", (uint32_t)HashResult);

		return HashResult;
	}


	// Hooks a specific NRS call site that always passes exactly 3 wchar_t* args (Platform, PlatformId, SaveKey)
	wchar_t* MKWScanfProxyForCrypto(wchar_t* ResultString, const wchar_t* Format, ...)
	{
		va_list args;
		va_start(args, Format);

		wchar_t* arg0 = va_arg(args, wchar_t*);
		wchar_t* arg1 = va_arg(args, wchar_t*);
		wchar_t* arg2 = va_arg(args, wchar_t*);

		va_end(args);

		auto SafeStringCopy = [](const wchar_t* src) -> wchar_t* {
			if (!src) return nullptr;
			size_t len = wcslen(src) + 1;
			wchar_t* copy = new wchar_t[len];
			wcscpy(copy, src);
			return copy;
			};

		auto SafeWcsCmp = [](const wchar_t* a, const wchar_t* b) -> bool {
			if (!a && !b) return true;
			if (!a || !b) return false;
			return wcscmp(a, b) == 0;
			};

		if (!SafeWcsCmp(HookMetadata::UserProfileInfo.Platform, arg0) ||
			!SafeWcsCmp(HookMetadata::UserProfileInfo.PlatformId, arg1) ||
			!SafeWcsCmp(HookMetadata::UserProfileInfo.SaveKey, arg2))
		{
			delete[] HookMetadata::UserProfileInfo.Platform;
			delete[] HookMetadata::UserProfileInfo.PlatformId;
			delete[] HookMetadata::UserProfileInfo.SaveKey;

			HookMetadata::UserProfileInfo.Platform = SafeStringCopy(arg0);
			HookMetadata::UserProfileInfo.PlatformId = SafeStringCopy(arg1);
			HookMetadata::UserProfileInfo.SaveKey = SafeStringCopy(arg2);

			if (SettingsMgr->iLogLevel)
				printf("Stored Profile Info:\nPlatform: %ws\nPlatformId: %ws\nSaveKey: %ws\n", arg0, arg1, arg2);
		}

		// Now call real function with full argsCopy
		return MK12::MKWScanf(ResultString, Format, arg0, arg1, arg2);
	}



	MK12::FKlassicLadderSecretFightData* SetupSecretFightConditionsProxy(MK12::FKlassicLadderSecretFightData* mSecretFightData)
	{
		printf("Found the index @ %p\n", mSecretFightData);
 		MK12::UKlassicTowerSecretFightData* mKlassicTowerSecretFightInstance = (MK12::UKlassicTowerSecretFightData*)(((uint64_t)(mSecretFightData)) - MK12::KlassicTowerSecretFightDataOffset);
		printf("Found the parent index @ %p\n", mKlassicTowerSecretFightInstance);

		MK12::FKlassicLadderSecretFightData* mSecretFightDataRet = MK12::SetupSecretFightConditions(mSecretFightData);

		if (!SettingsMgr->bSerializeSecretFights || !HookMetadata::ActiveModsMap["UNameTableGetter"])
			return mSecretFightData;

		if (mKlassicTowerSecretFightInstance)
		{
			MK12::FMissionBuildStep_KlassicTowerSecretFight& secretFightRules = mKlassicTowerSecretFightInstance->mSecretFightRulesBuildStep;

			printf("Floyd mDifficultyMaps: ");
			for (int i = 0; i < secretFightRules.mDifficultyMap.ElementsCount; i++) {
				printf("%02X ", secretFightRules.mDifficultyMap.Data[i]);
			}
			printf("\n");
		}


		char FightingStatCondition[]		= "LadderSecretFightCondition_FightingStatCondition";
		char MultiFightingStatCondition[]	= "LadderSecretFightCondition_MultiFightingStatCondition";
		char MoveTraceCondition[]			= "LadderSecretFightCondition_MoveTraceConditions";
		char ProfileStatCondition[]			= "LadderSecretFightCondition_ProfileStatCondition";

		// Start deserialization
		for (int i = 0; i < mSecretFightData->mConditions.ElementsCount; i++)
		{
			MK12::FKlassicLadderSecretFightCondition* CurrentCondition = MK12::TArrayHelpers::index<MK12::FKlassicLadderSecretFightCondition>(mSecretFightData->mConditions, i);
			MK12::FName* ScriptType = MK12::NameTableIndexToFName(&CurrentCondition->StructPtrType->ScriptClass);
			printf("Floyd Challenge %d - %s\n\tType %s\n", CurrentCondition->Index, MK12::EnumMaps::FloydChallengeMap[CurrentCondition->Index].c_str(), FNAME_STR(ScriptType));
			if (!CurrentCondition->enable)
			{
				printf("Disabled!");
				continue;
			}

			if (strncmp(ScriptType->Name, FightingStatCondition, MK12::FNameFunc::GetSize(*ScriptType)) == 0)
			{
				MK12::FLadderSecretFightCondition_FightingStatCondition* RetypedCondition = static_cast<MK12::FLadderSecretFightCondition_FightingStatCondition*>(CurrentCondition->StructPtrInstance);
				MK12::Remake::SecretFight::PrintTypedConditions(RetypedCondition);
			}
			else if (strncmp(ScriptType->Name, MultiFightingStatCondition, MK12::FNameFunc::GetSize(*ScriptType)) == 0)
			{
				MK12::FLadderSecretFightCondition_MultiFightingStatCondition* RetypedCondition = static_cast<MK12::FLadderSecretFightCondition_MultiFightingStatCondition*>(CurrentCondition->StructPtrInstance);
				MK12::Remake::SecretFight::PrintTypedConditions(RetypedCondition);
			}
			else if (strncmp(ScriptType->Name, MoveTraceCondition, MK12::FNameFunc::GetSize(*ScriptType)) == 0)
			{
				MK12::FLadderSecretFightCondition_MoveTraceConditions* RetypedCondition = static_cast<MK12::FLadderSecretFightCondition_MoveTraceConditions*>(CurrentCondition->StructPtrInstance);
				MK12::Remake::SecretFight::PrintTypedConditions(RetypedCondition);
			}
			else if (strncmp(ScriptType->Name, ProfileStatCondition, MK12::FNameFunc::GetSize(*ScriptType)) == 0)
			{
				MK12::FLadderSecretFightCondition_ProfileStatCondition* RetypedCondition = static_cast<MK12::FLadderSecretFightCondition_ProfileStatCondition*>(CurrentCondition->StructPtrInstance);
				MK12::Remake::SecretFight::PrintTypedConditions(RetypedCondition);
			}

			if (!CurrentCondition->CanCheckDuringFight)
			{
				printf("* Notification pops up after the match!\n");
			}
			printf("\n");
		}


