thethiny/MK12TTH/source/src/mk12hook.cpp
		return mSecretFightDataRet;
	}
};

// TODO: Curl interception not yet implemented. Below code is scaffolding for future use.
std::map<int, const char*> CURL_MAP
{
	{46,	"CURLOPT_UPLOAD"},
	{47,	"CURLOPT_POST"},
	{10001,	"CURLOPT_WRITEDATA"},
	{10029,	"CURLOPT_HEADERDATA"},
	{10002,	"CURLOPT_URL"},
	{10004,	"CURLOPT_PROXY"},
	{10173,	"CURLOPT_USERNAME"},
	{10005,	"CURLOPT_USERPWD"},
	{10023,	"CURLOPT_HTTPHEADER"},
	{60,	"CURLOPT_POSTFIELDSIZE"},
	{20012,	"CURLOPT_READFUNCTION"},
	{10009,	"CURLOPT_READDATA"},
	{10010,	"CURLOPT_ERRORBUFFER"},
	{8,		"CURLPROTO_FTPS"},
	{10015,	"CURLOPT_POSTFIELDS"},
	{20011,	"CURLOPT_WRITEFUNCTION"},
	{10018,	"CURLOPT_USERAGENT"},
	{80,	"CURLOPT_HTTPGET"},
	{81,	"CURLOPT_SSL_VERIFYHOST"},
	{14,	"CURLOPT_INFILESIZE"},
	{64,	"CURLOPT_SSL_VERIFYPEER"},
	{99,	"CURLOPT_NOSIGNAL"},
	{41,	"CURLOPT_VERBOSE"},
	{42,	"CURLOPT_HEADER"},
	{43,	"CURLOPT_NOPROGRESS"},
	{10086,	"CURLOPT_SSLCERTTYPE"},
	{20079, "CURLOPT_HEADERFUNCTION"},
	{20108, "CURLOPT_SSL_CTX_FUNCTION"},
	{10065, "CURLOPT_CAINFO"},
	{10097, "CURLOPT_CAPATH"},

};

bool bFirstPost = true;

enum class ArgTypes {
	ARGTYPE_NONE = 0, // UNK
	ARGTYPE_STRING, // String Pointer
	ARGTYPE_AGBINARY, // Data
	ARGTYPE_FUNCTION, // Callback
	ARGTYPE_CANCEL, // Return 0
	ARGTYPE_SETZERO, // Arg3 becomes 0
	ARGTYPE_INT, // Integer
	ARGTYPE_STRUCT, // Struct Pointer
};

// TODO: Uses == pointer comparison instead of strcmp - fix when curl interception is implemented
ArgTypes GetArgType(const char* arg_type)
{
	if (arg_type == "CURLOPT_URL")
		return ArgTypes::ARGTYPE_STRING;
	if (arg_type == "CURLOPT_USERAGENT")
		return ArgTypes::ARGTYPE_STRING;
	if (arg_type == "CURLOPT_WRITEDATA")
		return ArgTypes::ARGTYPE_STRUCT;
	if (arg_type == "CURLOPT_USERNAME")
		return ArgTypes::ARGTYPE_STRUCT;
	if (arg_type == "CURLOPT_USERPWD")
		return ArgTypes::ARGTYPE_STRUCT;
	if (arg_type == "CURLOPT_HEADERDATA")
		return ArgTypes::ARGTYPE_AGBINARY;
	if (arg_type == "CURLOPT_READDATA")
		return ArgTypes::ARGTYPE_AGBINARY;
	if (arg_type == "CURLOPT_WRITEFUNCTION")
		return ArgTypes::ARGTYPE_FUNCTION;
	if (arg_type == "CURLOPT_READFUNCTION")
		return ArgTypes::ARGTYPE_FUNCTION;
	if (arg_type == "CURLOPT_SSL_VERIFYPEER")
		return ArgTypes::ARGTYPE_SETZERO;
	if (arg_type == "CURLOPT_SSL_VERIFYHOST")
		return ArgTypes::ARGTYPE_SETZERO;
	if (arg_type == "CURLOPT_INFILESIZE")
		return ArgTypes::ARGTYPE_INT;
	if (arg_type == "CURLOPT_POSTFIELDSIZE")
		return ArgTypes::ARGTYPE_INT;
	if (arg_type == "CURLOPT_CAPATH")
		return ArgTypes::ARGTYPE_STRING;
	if (arg_type == "CURLOPT_CAINFO")
		return ArgTypes::ARGTYPE_STRING;
	if (arg_type == "CURLOPT_HEADERFUNCTION")
		return ArgTypes::ARGTYPE_FUNCTION;
	if (arg_type == "CURLOPT_SSL_CTX_FUNCTION")
		return ArgTypes::ARGTYPE_FUNCTION;
	if (arg_type == "CURLOPT_SSLCERTTYPE")
		return ArgTypes::ARGTYPE_STRING;
	return ArgTypes::ARGTYPE_NONE;
}

// Hooks
namespace MK12Hook::Hooks {

	bool DisableSignatureCheck()
	{
		printf("\n==DisableSignatureCheck==\n");

		uint64_t patAddr = GamePatcher->FindPatternOrFail(SettingsMgr->pSigCheck, "SigCheck");
		if (!patAddr)
			return false;

		GamePatcher->PatchReturn(patAddr - 0x14, 5);
		printfSuccess("SigCheck Patched");

		return true;
	}

	bool DisableSignatureWarn()
	{
		printf("\n==DisableSignatureWarn==\n");

		uint64_t patAddr = GamePatcher->FindPatternOrFail(SettingsMgr->pSigWarn, "SigWarn");
		if (!patAddr)
			return false;

		GamePatcher->ConditionalToUnconditional(patAddr + 0xA);
		printfSuccess("SigWarn Patched");

		return true;
	}

	bool DisableChunkSigCheck()
	{
		printf("\n==DisablePakChunkSigCheck==\n");

		uint64_t patAddr = GamePatcher->FindPatternOrFail(SettingsMgr->pChunkSigCheck, "ChunkSigCheck");
		if (!patAddr)
			return false;

		uint64_t funcAddr = GamePatcher->FindPatternOrFail(SettingsMgr->pChunkSigCheckFunc, "ChunkSigCheckFunc");
		if (!funcAddr)
			return false;

		GamePatcher->RedirectCall(patAddr + 0xE, funcAddr);
		printfSuccess("PakChunkSigCheck Patched");

		return true;
	}

	bool DisableTOCSigCheck()
	{
		printf("\n==DisableTOCSigCheck==\n");

		uint64_t patAddr = GamePatcher->FindPatternOrFail(SettingsMgr->pTocCheck, "TocSigCheck");
		if (!patAddr)
			return false;

		GamePatcher->ConditionalToUnconditional(patAddr + 0x12);
		printfSuccess("TocSigCheck Patched");

		return true;
	}

	bool DisablePakTOCCheck()
	{
		printf("\n==DisablePakTOCCheck==\n");

		uint64_t patAddr = GamePatcher->FindPatternOrFail(SettingsMgr->pPakTocCheck, "PakTocCheck");
		if (!patAddr)
			return false;

		GamePatcher->ConditionalToUnconditional(patAddr + 0x12);
		printfSuccess("PakTocCheck Patched");

		return true;
	}

	bool FNameToStrWithIdLoader()
	{
		printf("\n==ProxyFPathIdLoader==\n");

		uint64_t patAddr = GamePatcher->FindPatternOrFail(SettingsMgr->pFPathLoadPat, "FPathLoad");
		if (!patAddr)
			return false;

		GamePatcher->ProxyCallSite(patAddr + 0xB, MK12Hook::Proxies::ReadFNameToWStrId, &MK12::FNameToWStr, PATCH_CALL);
		printfSuccess("FPathLoad Proxied");

		uint64_t func_start = patAddr - 0x6F;
		if (*(uint8_t*)func_start != 0x48)
		{
			printfError("FPathLoad Start not found!");
		}
		else
		{
			MK12::ReadFNameToWStrWithIdStart = (uint64_t*)func_start;
			if (SettingsMgr->iLogLevel)
				printf("FPathLoad Func Start is at: %p\n", MK12::ReadFNameToWStrWithIdStart);
		}

		return true;
	}

	bool FNameToStrNoIdLoader()
	{
		printf("\n==ProxyFPathNoIdLoader==\n");

		uint64_t patAddr = GamePatcher->FindPatternOrFail(SettingsMgr->pFPath2LoadPat, "FPath2Load");
		if (!patAddr)
			return false;

		GamePatcher->ProxyCallSite(patAddr + 0xB, MK12Hook::Proxies::ReadFNameToWStrNoId, &MK12::FNameToWStr, PATCH_CALL);
		printfSuccess("FPath2Load Proxied");

		uint64_t func_start = patAddr - 0x55;
		if (*(uint8_t*)func_start != 0x48)
		{
			printfError("FPath2Load Start not found!");
		}
		else
		{
			MK12::ReadFNameToWStrNoIdStart = (uint64_t*)func_start;
			if (SettingsMgr->iLogLevel)
				printf("FPath2Load Func Start is at: %p\n", MK12::ReadFNameToWStrNoIdStart);
		}

