thethiny/MK12TTH/source/src/mk12hook.cpp
		return true;
	}

	bool FNameToStrCommonLoader()
	{
		printf("\n==ProxyFPathCommonLoader==\n");

		uint64_t patAddr = GamePatcher->FindPatternOrFail(SettingsMgr->pFPathCLoadPat, "FPathCLoad");
		if (!patAddr)
			return false;

		GamePatcher->ProxyCallSite(patAddr + 0x00, MK12Hook::Proxies::ReadFNameToWStrCommon, &MK12::FNameToWStr, PATCH_CALL);
		printfSuccess("FPathCLoad Proxied");

		uint64_t func_start = patAddr - 0x10;
		if (*(uint8_t*)func_start != 0x48)
		{
			printfError("FPathCLoad Start not found!");
		}
		else
		{
			MK12::ReadFNameToWStrCommonStart = (uint64_t*)func_start;
			if (SettingsMgr->iLogLevel)
				printf("FPathCLoad Func Start is at: %p\n", MK12::ReadFNameToWStrCommonStart);
		}

		return true;
	}

	bool UNameTableGetter()
	{
		printf("\n==UNameObjectGetter==\n");

		uint64_t patAddr = GamePatcher->FindPatternOrFail(SettingsMgr->pUNameObjGetPat, "UNameObjGet");
		if (!patAddr)
			return false;

		uint64_t* lpPattern = (uint64_t*)patAddr;

		uint64_t UNameMain	= ProcessPatch::GetDestinationFromOpCode((uint64_t)lpPattern, 2, 7, 4) - 0x8;
		uint64_t UNameSub	= ProcessPatch::GetDestinationFromOpCode((uint64_t)lpPattern + 0x12, 3, 7, 4);

		if (SettingsMgr->iLogLevel)
		{
			printf("UNameMain Object found at: %p\n", (uint64_t*)UNameMain);
			printf("UNameSub Object found at: %p\n", (uint64_t*)UNameSub);
		}

		// Find NameTable here for now until moving it to a different place
		MK12::UNameTable = (MK12::UNameTableStruct*)UNameSub;
		MK12::UMainNameTable = (MK12::UNameTableMainStruct*)UNameMain; // Can be UNameTable - 0x10

		printfSuccess("UName Objects Saved!\n");

		printf("\n==InitializeNameTableProxy==\n");

		uint64_t InitNameTableFuncAddr = (uint64_t)lpPattern + 0x22;
		if (*(uint8_t*)InitNameTableFuncAddr != 0xE8) // Call
		{
			printfError("InitializeNameTable Function not found!\n");
			return false;
		}
		if (SettingsMgr->iLogLevel)
		{
			printf("InitializeNameTable Function found at: %p\n", (uint64_t*)InitNameTableFuncAddr);
		}

		MK12::InitializeNameTable = (MK12::InitializeNameTableType*)ProcessPatch::GetDestinationFromOpCode(InitNameTableFuncAddr);
		printfSuccess("InitializeNameTableFunction!\n");

		return true;
	}

	bool OverrideFNameToWStrFuncs()
	{
		if (SettingsMgr->iLogLevel)
			printfYellow("String Swap Mode set to Override!\n");

		if (!SettingsMgr->bUNameGetter)
		{
			printfWarning("Overriding FNameToWStr disabled: bUNameGetter is not enabled in ini!\n");
			return false;
		}
		if (!HookMetadata::ActiveModsMap["UNameTableGetter"])
		{
			printfError("Overriding FNameToWStr disabled: UNameTableGetter pattern failed!");
			return false;
		}

		if (MK12::ReadFNameToWStrWithIdStart == nullptr)
		{
			if (SettingsMgr->bFNameToStrHook)
			{
				if (HookMetadata::ActiveModsMap["bFPathIdLoader"])
				{
					printfYellow("Failed to override FNameToWStrId, but Proxy Loader is working.\n");
				}
				else
				{
					printfError("Failed to override FNameToWStrId and Proxy Loader is NOT working!");
				}
			}
		}
		else
		{
			GamePatcher->ReplaceFunction((uint64_t)MK12::ReadFNameToWStrWithIdStart, MK12::Remake::FNameInfoToWStringWithId);
			if (SettingsMgr->bFNameToStrHook && HookMetadata::ActiveModsMap["bFPathIdLoader"])
				printfYellow("FNameToWStrId replacing Proxy Loader\n");
			else
				printfSuccess("Overrided FNameToWStrId skipping Proxy Loader");
		}

		if (MK12::ReadFNameToWStrNoIdStart == nullptr)
		{
			if (SettingsMgr->bFNameToStrHook)
			{
				if (HookMetadata::ActiveModsMap["bFPathNoIdLoader"])
				{
					printfYellow("Failed to override FNameToWStrNoId, but Proxy Loader is working.\n");
				}
				else
				{
					printfError("Failed to override FNameToWStrNoId and Proxy Loader is NOT working!");
				}
			}
		}
		else
		{
			GamePatcher->ReplaceFunction((uint64_t)MK12::ReadFNameToWStrNoIdStart, MK12::Remake::FNameInfoToWStringNoId);
			if (SettingsMgr->bFNameToStrHook && HookMetadata::ActiveModsMap["bFPathNoIdLoader"])
				printfYellow("FNameToWStrNoId replacing Proxy Loader\n");
			else
				printfSuccess("Overrided FNameToWStrNoId skipping Proxy Loader");
		}

		if (MK12::ReadFNameToWStrCommonStart == nullptr)
		{
			if (SettingsMgr->bFNameToStrHook)
			{
				if (HookMetadata::ActiveModsMap["bFPathCommonLoader"])
				{
					printfYellow("Failed to override FNameToWStrCommon, but Proxy Loader is working.\n");
				}
				else
				{
					printfError("Failed to override FNameToWStrCommon and Proxy Loader is NOT working!");
				}
			}
		}
		else
		{
			GamePatcher->ReplaceFunction((uint64_t)MK12::ReadFNameToWStrCommonStart, MK12::Remake::FNameInfoToWString);
			if (SettingsMgr->bFNameToStrHook && HookMetadata::ActiveModsMap["bFPathCommonLoader"])
				printfYellow("FNameToWStrCommon replacing Proxy Loader\n");
			else
				printfSuccess("Overrided FNameToWStrCommon skipping Proxy Loader");
		}

		bool anyOverride = MK12::ReadFNameToWStrWithIdStart || MK12::ReadFNameToWStrNoIdStart || MK12::ReadFNameToWStrCommonStart;
		if (anyOverride)
			printfSuccess("FNameToWStr Override Active");
		else
			printfWarning("FNameToWStr Override: No function starts found, falling back to Proxy Loaders");

		return true;
	}

	bool OverrideGameEndpointsData()
	{
		printf("\n==OverrideGameEndpointsData==\n");

		if (SettingsMgr->szServerUrl.empty())
		{
			printfWarning("Server Url is empty or not specified. Skipping!");
			return false;
		}

		return GamePatcher->HookPattern(SettingsMgr->pEndpointLoader, "EndpointLoader", 0x00,
			MK12Hook::Proxies::OverrideGameEndpoint, &MK12::GetEndpointKeyValue, PATCH_CALL);
	}

	bool ProfileGetterHooks()
	{
		printf("\n==ProfileGetterHooks==\n");

		return GamePatcher->HookPattern(SettingsMgr->pProfileGetter, "ProfileGetter", 30,
			MK12Hook::Proxies::MKWScanfProxyForCrypto, &MK12::MKWScanf, PATCH_CALL);
	}

	int FloydTrackingHooks()
	{
		printf("\n==FloydTrackingHooks==\n");

