thethiny/MK12TTH/source/src/mk12hook.cpp
		int HooksCtr = 0;
		int ExpectedHooksCtr = 3;

		HooksCtr += GamePatcher->HookPattern(SettingsMgr->pGetChallengesFromHash, "GetChallengesFromHash", 14,
			MK12Hook::Proxies::GenerateFloydCluesFromHashProxy, &MK12::GenerateFloydCluesFromHash, PATCH_CALL);

		HooksCtr += GamePatcher->HookPattern(SettingsMgr->pGetFloydHashInputString, "GetFloydHashInputString", 11,
			MK12Hook::Proxies::CustomCityHashProxy, &MK12::CustomCityHash, PATCH_CALL);

		HooksCtr += GamePatcher->HookPattern(SettingsMgr->pGetFloydHashInputString2, "GetFloydHashInputString2", 11,
			MK12Hook::Proxies::CustomCityHashProxy, &MK12::CustomCityHash, PATCH_CALL);

		if (HooksCtr == ExpectedHooksCtr)
			printfSuccess("Floyd Tracking On");
		else if (HooksCtr)
			printfWarning("Not all Floyd Trackers functioning!");
		else
			printfError("Floyd Tracking not working!");

		return HooksCtr;
	}

	bool ExtractFightMetadataFromSecretFightSetupStage()
	{
		printf("\n==ExtractFightMetadataFromSecretFightSetupStage==\n");

		uint64_t patAddr = GamePatcher->FindPatternOrFail(SettingsMgr->pSecretFightCondPat, "SecretFightConditionSetup");
		if (!patAddr)
			return false;

		MK12::KlassicTowerSecretFightDataOffset = 0x80;

		GamePatcher->ProxyCallSite(patAddr + 77, MK12Hook::Proxies::SetupSecretFightConditionsProxy, &MK12::SetupSecretFightConditions, PATCH_JUMP);
		printfSuccess("SecretFightConditionSetup Proxied");

		return true;
	}

};

namespace MK12Hook::Mods {
	static const char* AnnouncerSwapString = "/Game/WwiseAudio/Switches/SWITCHES_All/SWGP_Announcer/SWGP_Announcer-SWTC_ANNO_%s.SWGP_Announcer-SWTC_ANNO_%s";
	static const std::string* AllAnnouncerStrings[] = {
		&SettingsMgr->AnnouncerSwap.szDefault,
		&SettingsMgr->AnnouncerSwap.szGeras,
		&SettingsMgr->AnnouncerSwap.szJohnnyCage,
		&SettingsMgr->AnnouncerSwap.szLiuKang,
		&SettingsMgr->AnnouncerSwap.szOmniMan,
		&SettingsMgr->AnnouncerSwap.szShangTsung,
		&SettingsMgr->AnnouncerSwap.szSindel,
		&SettingsMgr->AnnouncerSwap.szSubZero
	};
	static const char* AllAnnouncerNames[] = {
		"Default",
		"Geras",
		"JohnnyCage",
		"LiuKang",
		"OmniMan",
		"ShangTsung",
		"Sindel",
		"SubZero"
	};
	int AnnouncerSwap()
	{
		printf("\n==Swapping Announcers==\n");
		if (!SettingsMgr->bFNameToStrHook)
		{
			printfError("No FPath Swapper has been loaded. Make sure bFPathLoader is enabled.");
			return false;
		}
		if (!HookMetadata::ActiveModsMap["bFPathIdLoader"])
		{
			printfError("No FPath Swapper has been loaded. FNameToStrWithIdLoader Patching was unsuccessful.");
			return false;
		}
	
		char CurAnnoString[256];
		char SwapAnnoString[256];
		int count = 0;
		for (int i = 0; i < 8; i++)
		{
			if (AllAnnouncerStrings[i]->empty())
				continue;

			if (strcmp(AllAnnouncerStrings[i]->c_str(), AllAnnouncerNames[i]) == 0) // No Swap
				continue;
			
			snprintf(CurAnnoString, sizeof(CurAnnoString), AnnouncerSwapString, AllAnnouncerNames[i], AllAnnouncerNames[i]);
			snprintf(SwapAnnoString, sizeof(SwapAnnoString), AnnouncerSwapString, AllAnnouncerStrings[i]->c_str(), AllAnnouncerStrings[i]->c_str());
			HookMetadata::FSwapTable.insert(CurAnnoString, SwapAnnoString);
			count++;
		}

		printfYellow("%d Announcers swapped.\n", count);
		int iDebugSwap = 0;

		//HookMetadata::FSwapTable.insert(Proxies::OriginalModifierName, Proxies::NewModifierName);
		//{
		//	const char* a1 = "/Game/DLC/REL_GOTY/Char/SubZero/Skin/007/Blueprint/BP_SubZero_Skin007_A_Char.BP_SubZero_Skin007_A_Char_C";
		//	const char* a2 = "/Game/Disk/Char/SubZero/Skin/002/Blueprint/BP_SubZero_Skin002_A_Char.BP_SubZero_Skin002_A_Char_C";
		//	//const char* a2 = "/Game/DLC/REL_T1000/Char/SubZero/Skin/009/Blueprint/BP_SubZero_Skin009_A_Char.BP_SubZero_Skin009_A_Char_C";
		//	HookMetadata::FSwapTable.insert(a1, a2);
		//	iDebugSwap++;
		//}
		//{
		//	const char* a1 = "/Game/DLC/REL_GOTY/Char/SubZero/Skin/007/Blueprint/BP_SubZero_Skin007_A_Char";
		//	const char* a2 = "/Game/Disk/Char/SubZero/Skin/002/Blueprint/BP_SubZero_Skin002_A_Char";
		//	HookMetadata::FSwapTable.insert(a1, a2);
		//	iDebugSwap++;
		//}
		/*{
			const char* a1 = "/Game/DLC/REL_T1000/Char/T1000/Skin/001/Palette/SetA/Blueprint/BP_T1000_Skin001_Pal001.BP_T1000_Skin001_Pal001_C";
			const char* a2 = "/Game/DLC/REL_GOTY/Char/SubZero/Skin/007/Palette/SetA/Blueprint/BP_SubZero_Skin007_Pal002.BP_SubZero_Skin007_Pal002_C";
			HookMetadata::FSwapTable.insert(a1, a2);
			iDebugSwap++;
		}
		{
			const char* a1 = "/Game/DLC/REL_T1000/Char/T1000/Skin/001/Palette/SetA/Blueprint/BP_T1000_Skin001_Pal001";
			const char* a2 = "/Game/DLC/REL_GOTY/Char/SubZero/Skin/007/Palette/SetA/Blueprint/BP_SubZero_Skin007_Pal002";
			HookMetadata::FSwapTable.insert(a1, a2);
			iDebugSwap++;
		}
		{
			const char* a1 = "/Game/DLC/REL_T1000/Char/T1000/Skin/001/Blueprint/BP_T1000_Skin001_A_Char";
			const char* a2 = "/Game/DLC/REL_GOTY/Char/SubZero/Skin/007/Blueprint/BP_SubZero_Skin007_A_Char";
			HookMetadata::FSwapTable.insert(a1, a2);
			iDebugSwap++;
		}
		{
			const char* a1 = "/Game/DLC/REL_T1000/Char/T1000/Skin/001/Blueprint/BP_T1000_Skin001_A_Char.BP_T1000_Skin001_A_Char_C";
			const char* a2 = "/Game/DLC/REL_GOTY/Char/SubZero/Skin/007/Blueprint/BP_SubZero_Skin007_A_Char.BP_SubZero_Skin007_A_Char_C";
			HookMetadata::FSwapTable.insert(a1, a2);
			iDebugSwap++;
		}
		{
			const char* a1 = "/Game/DLC/REL_T1000/Char/T1000/Template/Blueprint/BP_T1000_CharSelect_Anim.BP_T1000_CharSelect_Anim_C";
			const char* a2 = "/Game/Disk/Char/SubZero/Template/Blueprint/BP_SubZero_CharSelect_Anim.BP_SubZero_CharSelect_Anim_C";
			HookMetadata::FSwapTable.insert(a1, a2);
			iDebugSwap++;
		}
		{
			const char* a1 = "/Game/DLC/REL_T1000/Char/T1000/Template/Blueprint/BP_T1000_CharSelect_Anim";
			const char* a2 = "/Game/Disk/Char/SubZero/Template/Blueprint/BP_SubZero_CharSelect_Anim";
			HookMetadata::FSwapTable.insert(a1, a2);
			iDebugSwap++;
		}*/
		//printfYellow("DEBUG swapped %d.\n", iDebugSwap);


		
		return count;
	}
	int StringSwaps()
	{
		printf("\n==Swapping Strings==\n");
		if (!SettingsMgr->bFNameToStrHook)
		{
			printfError("No FPath Swapper has been loaded. Make sure bFPathLoader is enabled.");
			return -1;
		}
		if (!HookMetadata::ActiveModsMap["bFPathIdLoader"])
		{
			printfError("No FPath Swapper has been loaded. FNameToStrWithIdLoader Patching was unsuccessful.");
			return -1;
		}
		if (HookMetadata::ActiveModsMap["UNameTableGetter"])
		{
			printfError("Currently using String Swaps with `bUNameGetter` set to `true` is not supported. Only `bFPathLoader` must be `true`.");
			return -1;
		}

		std::ifstream file("string_swaps.txt");

		CPPython::string line;
		int iSwapsAmount = 0;

		if (!file.is_open()) {
			printfError("Failed to open string_swaps.txt\n");
			return -1;
		}

		while (std::getline(file, line)) {
			CPPython::string stripped_line = line.strip();
			auto parts = stripped_line.split("->");

			if (parts.size() == 2) {
				CPPython::string a1 = parts[0].strip(" ");
				CPPython::string a2 = parts[1].strip(" ");
				HookMetadata::FSwapTable.insert(a1.c_str(), a2.c_str());
				std::cout << "Inserted: " << a1 << " -> " << a2 << std::endl;
				iSwapsAmount++;
			}
		}

		file.close();
		printfYellow("%d Strings swapped.\n", iSwapsAmount);
		return iSwapsAmount;
	}
}

namespace HookMetadata {
	HHOOK KeyboardProcHook = nullptr;
	HMODULE CurrentDllModule = NULL;
	HANDLE Console = NULL;
};